ahtn/keyplus/ports/efm8/efm8/mcu/C8051F930/inc/SI_C8051F930_Register_Enums.h
#define RTC0CN_RTC0SET__BMASK    0x02 ///< RTC Timer Set                                   
#define RTC0CN_RTC0SET__SHIFT    0x01 ///< RTC Timer Set                                   
#define RTC0CN_RTC0SET__NOT_SET  0x00 ///< Do not start a set operation.                   
#define RTC0CN_RTC0SET__SET      0x02 ///< Start a set operation.                          
                                                                                           
#define RTC0CN_ALRM__BMASK       0x04 ///< RTC Alarm Event Flag and Auto Reset Enable      
#define RTC0CN_ALRM__SHIFT       0x02 ///< RTC Alarm Event Flag and Auto Reset Enable      
#define RTC0CN_ALRM__NOT_SET     0x00 ///< Alarm event flag is not set or disable the auto 
                                      ///< reset function.                                 
#define RTC0CN_ALRM__SET         0x04 ///< Alarm event flag is set or enable the auto reset
                                      ///< function.                                       
                                                                                           
#define RTC0CN_RTC0AEN__BMASK    0x08 ///< RTC Alarm Enable                                
#define RTC0CN_RTC0AEN__SHIFT    0x03 ///< RTC Alarm Enable                                
#define RTC0CN_RTC0AEN__DISABLED 0x00 ///< Disable RTC alarm.                              
#define RTC0CN_RTC0AEN__ENABLED  0x08 ///< Enable RTC alarm.                               
                                                                                           
#define RTC0CN_RTC0TR__BMASK     0x10 ///< RTC Timer Run Control                           
#define RTC0CN_RTC0TR__SHIFT     0x04 ///< RTC Timer Run Control                           
#define RTC0CN_RTC0TR__STOP      0x00 ///< RTC timer is stopped.                           
#define RTC0CN_RTC0TR__RUN       0x10 ///< RTC timer is running.                           
                                                                                           
#define RTC0CN_OSCFAIL__BMASK    0x20 ///< RTC Oscillator Fail Event Flag                  
#define RTC0CN_OSCFAIL__SHIFT    0x05 ///< RTC Oscillator Fail Event Flag                  
#define RTC0CN_OSCFAIL__NOT_SET  0x00 ///< Missing RTC detector timeout did not occur.     
#define RTC0CN_OSCFAIL__SET      0x20 ///< Missing RTC detector timeout occurred.          
                                                                                           
#define RTC0CN_MCLKEN__BMASK     0x40 ///< Missing RTC Detector Enable                     
#define RTC0CN_MCLKEN__SHIFT     0x06 ///< Missing RTC Detector Enable                     
#define RTC0CN_MCLKEN__DISABLED  0x00 ///< Disable missing RTC detector.                   
#define RTC0CN_MCLKEN__ENABLED   0x40 ///< Enable missing RTC detector.                    
                                                                                           
#define RTC0CN_RTC0EN__BMASK     0x80 ///< RTC Enable                                      
#define RTC0CN_RTC0EN__SHIFT     0x07 ///< RTC Enable                                      
#define RTC0CN_RTC0EN__DISABLED  0x00 ///< Disable RTC oscillator.                         
#define RTC0CN_RTC0EN__ENABLED   0x80 ///< Enable RTC oscillator.                          
                                                                                           
//------------------------------------------------------------------------------
// RTC0DAT Enums (RTC Data @ 0xAD)
//------------------------------------------------------------------------------
#define RTC0DAT_RTC0DAT__FMASK 0xFF ///< RTC Data
#define RTC0DAT_RTC0DAT__SHIFT 0x00 ///< RTC Data
                                                 
//------------------------------------------------------------------------------
// RTC0KEY Enums (RTC Lock and Key @ 0xAE)
//------------------------------------------------------------------------------
#define RTC0KEY_RTC0ST__FMASK           0xFF ///< RTC Interface Lock/Key and Status                 
#define RTC0KEY_RTC0ST__SHIFT           0x00 ///< RTC Interface Lock/Key and Status                 
#define RTC0KEY_RTC0ST__LOCKED          0x00 ///< RTC Interface is locked. Writing 0xA5 followed by 
                                             ///< 0xF1 unlocks the RTC interface.                   
#define RTC0KEY_RTC0ST__FIRST           0x01 ///< RTC Interface is locked, but 0xA5 has already been
                                             ///< written. Writing any value other than the second  
                                             ///< key code (0xF1) will change this field to 3 and   
                                             ///< disable the RTC interface until the next system   
                                             ///< reset.                                            
#define RTC0KEY_RTC0ST__UNLOCKED        0x02 ///< RTC Interface is unlocked. Any write to the       
                                             ///< RTC0KEY register will lock the RTC Interface.     
#define RTC0KEY_RTC0ST__DISABLED        0x03 ///< RTC Interface is disabled until the next system   
                                             ///< reset. Any writes to RTC0KEY have no effect.      
#define RTC0KEY_RTC0ST__DISABLE_OR_LOCK 0x0A ///< Writing any value other than 0xF1 for the second  
                                             ///< byte will disable the interface. Writing any value
                                             ///< when the interface is unlocked will lock the      
                                             ///< interface.                                        
#define RTC0KEY_RTC0ST__KEY1            0xA5 ///< Writing 0xA5 followed by 0xF1 unlocks the RTC     
                                             ///< interface.                                        
#define RTC0KEY_RTC0ST__KEY2            0xF1 ///< Writing 0xA5 followed by 0xF1 unlocks the RTC     
                                             ///< interface.                                        
                                                                                                    
//------------------------------------------------------------------------------
// RTC0PIN Enums (RTC Pin Configuration @ 0x07)
//------------------------------------------------------------------------------
#define RTC0PIN_RTCPIN__FMASK          0xFF ///< RTC Pin Configuration                             
#define RTC0PIN_RTCPIN__SHIFT          0x00 ///< RTC Pin Configuration                             
#define RTC0PIN_RTCPIN__NORMAL         0x67 ///< XTAL3 and XTAL4 are in their normal configuration.
#define RTC0PIN_RTCPIN__SELF_OSCILLATE 0xE7 ///< XTAL3 and XTAL4 are internally shorted for use    
                                            ///< with self-oscillate mode.                         
                                                                                                   
//------------------------------------------------------------------------------
// RTC0XCF Enums (RTC Oscillator Configuration @ 0x06)
//------------------------------------------------------------------------------
#define RTC0XCF_LOADCAP__FMASK    0x0F ///< Load Capacitance Programmed Value                
#define RTC0XCF_LOADCAP__SHIFT    0x00 ///< Load Capacitance Programmed Value                
                                                                                             
#define RTC0XCF_LOADRDY__BMASK    0x40 ///< Load Capacitance Ready Indicator                 
#define RTC0XCF_LOADRDY__SHIFT    0x06 ///< Load Capacitance Ready Indicator                 
#define RTC0XCF_LOADRDY__NOT_SET  0x00 ///< Load capacitance is currently stepping.          
#define RTC0XCF_LOADRDY__SET      0x40 ///< Load capacitance has reached it programmed value.
                                                                                             
#define RTC0XCF_AUTOSTP__BMASK    0x80 ///< Automatic Load Capacitance Stepping Enable       
#define RTC0XCF_AUTOSTP__SHIFT    0x07 ///< Automatic Load Capacitance Stepping Enable       
#define RTC0XCF_AUTOSTP__DISABLED 0x00 ///< Disable load capacitance stepping.               
#define RTC0XCF_AUTOSTP__ENABLED  0x80 ///< Enable load capacitance stepping.                
                                                                                             
//------------------------------------------------------------------------------
// RTC0XCN Enums (RTC Oscillator Control @ 0x05)
//------------------------------------------------------------------------------
#define RTC0XCN_CLKVLD__BMASK         0x10 ///< RTC Oscillator Crystal Valid Indicator            
#define RTC0XCN_CLKVLD__SHIFT         0x04 ///< RTC Oscillator Crystal Valid Indicator            
#define RTC0XCN_CLKVLD__NOT_SET       0x00 ///< Oscillation has not started or oscillation        
                                           ///< amplitude is too low to maintain oscillation.     
#define RTC0XCN_CLKVLD__SET           0x10 ///< Sufficient oscillation amplitude detected.        
                                                                                                  
#define RTC0XCN_BIASX2__BMASK         0x20 ///< RTC Oscillator Bias Double Enable                 
#define RTC0XCN_BIASX2__SHIFT         0x05 ///< RTC Oscillator Bias Double Enable                 
#define RTC0XCN_BIASX2__DISABLED      0x00 ///< Disable the Bias Double feature.                  
#define RTC0XCN_BIASX2__ENABLED       0x20 ///< Enable the Bias Double feature.                   
                                                                                                  
#define RTC0XCN_XMODE__BMASK          0x40 ///< RTC Oscillator Mode                               
#define RTC0XCN_XMODE__SHIFT          0x06 ///< RTC Oscillator Mode                               
#define RTC0XCN_XMODE__SELF_OSCILLATE 0x00 ///< Self-Oscillate Mode selected.                     
#define RTC0XCN_XMODE__CRYSTAL        0x40 ///< Crystal Mode selected.                            
                                                                                                  
#define RTC0XCN_AGCEN__BMASK          0x80 ///< RTC Oscillator Automatic Gain Control (AGC) Enable
#define RTC0XCN_AGCEN__SHIFT          0x07 ///< RTC Oscillator Automatic Gain Control (AGC) Enable
#define RTC0XCN_AGCEN__DISABLED       0x00 ///< Disable AGC.                                      
#define RTC0XCN_AGCEN__ENABLED        0x80 ///< Enable AGC.                                       
                                                                                                  
//------------------------------------------------------------------------------
// SMB0ADM Enums (SMBus 0 Slave Address Mask @ 0xF5)
//------------------------------------------------------------------------------
#define SMB0ADM_EHACK__BMASK             0x01 ///< Hardware Acknowledge Enable                     
#define SMB0ADM_EHACK__SHIFT             0x00 ///< Hardware Acknowledge Enable                     
#define SMB0ADM_EHACK__ADR_ACK_MANUAL    0x00 ///< Firmware must manually acknowledge all incoming 
                                              ///< address and data bytes.                         
#define SMB0ADM_EHACK__ADR_ACK_AUTOMATIC 0x01 ///< Automatic slave address recognition and hardware
                                              ///< acknowledge is enabled.                         
                                                                                                   
#define SMB0ADM_SLVM__FMASK              0xFE ///< SMBus Slave Address Mask                        
#define SMB0ADM_SLVM__SHIFT              0x01 ///< SMBus Slave Address Mask                        
                                                                                                   
//------------------------------------------------------------------------------
// SMB0ADR Enums (SMBus 0 Slave Address @ 0xF4)
//------------------------------------------------------------------------------
#define SMB0ADR_GC__BMASK      0x01 ///< General Call Address Enable        
#define SMB0ADR_GC__SHIFT      0x00 ///< General Call Address Enable        
#define SMB0ADR_GC__IGNORED    0x00 ///< General Call Address is ignored.   
#define SMB0ADR_GC__RECOGNIZED 0x01 ///< General Call Address is recognized.
                                                                            
#define SMB0ADR_SLV__FMASK     0xFE ///< SMBus Hardware Slave Address       
#define SMB0ADR_SLV__SHIFT     0x01 ///< SMBus Hardware Slave Address       
                                                                            
//------------------------------------------------------------------------------
// SMB0CF Enums (SMBus 0 Configuration @ 0xC1)
//------------------------------------------------------------------------------
#define SMB0CF_SMBCS__FMASK             0x03 ///< SMBus Clock Source Selection                     
#define SMB0CF_SMBCS__SHIFT             0x00 ///< SMBus Clock Source Selection                     
#define SMB0CF_SMBCS__TIMER0            0x00 ///< Timer 0 Overflow.                                
#define SMB0CF_SMBCS__TIMER1            0x01 ///< Timer 1 Overflow.                                
#define SMB0CF_SMBCS__TIMER2_HIGH       0x02 ///< Timer 2 High Byte Overflow.                      
#define SMB0CF_SMBCS__TIMER2_LOW        0x03 ///< Timer 2 Low Byte Overflow.                       
                                                                                                   
#define SMB0CF_SMBFTE__BMASK            0x04 ///< SMBus Free Timeout Detection Enable              
#define SMB0CF_SMBFTE__SHIFT            0x02 ///< SMBus Free Timeout Detection Enable              
#define SMB0CF_SMBFTE__FREE_TO_DISABLED 0x00 ///< Disable bus free timeouts.                       
#define SMB0CF_SMBFTE__FREE_TO_ENABLED  0x04 ///< Enable bus free timeouts. The bus the bus will be
                                             ///< considered free if SCL and SDA remain high for   
                                             ///< more than 10 SMBus clock source periods.         
                                                                                                   
#define SMB0CF_SMBTOE__BMASK            0x08 ///< SMBus SCL Timeout Detection Enable               
#define SMB0CF_SMBTOE__SHIFT            0x03 ///< SMBus SCL Timeout Detection Enable               
#define SMB0CF_SMBTOE__SCL_TO_DISABLED  0x00 ///< Disable SCL low timeouts.                        
#define SMB0CF_SMBTOE__SCL_TO_ENABLED   0x08 ///< Enable SCL low timeouts.                         
                                                                                                   
#define SMB0CF_EXTHOLD__BMASK           0x10 ///< SMBus Setup and Hold Time Extension Enable       
#define SMB0CF_EXTHOLD__SHIFT           0x04 ///< SMBus Setup and Hold Time Extension Enable       
#define SMB0CF_EXTHOLD__DISABLED        0x00 ///< Disable SDA extended setup and hold times.       
#define SMB0CF_EXTHOLD__ENABLED         0x10 ///< Enable SDA extended setup and hold times.        
                                                                                                   
#define SMB0CF_BUSY__BMASK              0x20 ///< SMBus Busy Indicator                             
#define SMB0CF_BUSY__SHIFT              0x05 ///< SMBus Busy Indicator                             
#define SMB0CF_BUSY__NOT_SET            0x00 ///< The bus is not busy.                             
#define SMB0CF_BUSY__SET                0x20 ///< The bus is busy and a transfer is currently in   
                                             ///< progress.                                        
                                                                                                   
#define SMB0CF_INH__BMASK               0x40 ///< SMBus Slave Inhibit                              
#define SMB0CF_INH__SHIFT               0x06 ///< SMBus Slave Inhibit                              
#define SMB0CF_INH__SLAVE_ENABLED       0x00 ///< Slave states are enabled.                        
#define SMB0CF_INH__SLAVE_DISABLED      0x40 ///< Slave states are inhibited.                      
                                                                                                   
#define SMB0CF_ENSMB__BMASK             0x80 ///< SMBus Enable                                     
#define SMB0CF_ENSMB__SHIFT             0x07 ///< SMBus Enable                                     
#define SMB0CF_ENSMB__DISABLED          0x00 ///< Disable the SMBus module.                        
#define SMB0CF_ENSMB__ENABLED           0x80 ///< Enable the SMBus module.                         
                                                                                                   
//------------------------------------------------------------------------------
// SMB0CN Enums (SMBus 0 Control @ 0xC0)
//------------------------------------------------------------------------------
#define SMB0CN_SI__BMASK           0x01 ///< SMBus Interrupt Flag                           
#define SMB0CN_SI__SHIFT           0x00 ///< SMBus Interrupt Flag                           
#define SMB0CN_SI__NOT_SET         0x00 ///<                                                
#define SMB0CN_SI__SET             0x01 ///<                                                
                                                                                            
#define SMB0CN_ACK__BMASK          0x02 ///< SMBus Acknowledge                              
#define SMB0CN_ACK__SHIFT          0x01 ///< SMBus Acknowledge                              
#define SMB0CN_ACK__NOT_SET        0x00 ///< Generate a NACK, or the response was a NACK.   
#define SMB0CN_ACK__SET            0x02 ///< Generate an ACK, or the response was an ACK.   
                                                                                            
#define SMB0CN_ARBLOST__BMASK      0x04 ///< SMBus Arbitration Lost Indicator               
#define SMB0CN_ARBLOST__SHIFT      0x02 ///< SMBus Arbitration Lost Indicator               
#define SMB0CN_ARBLOST__NOT_SET    0x00 ///< No arbitration error.                          
#define SMB0CN_ARBLOST__ERROR      0x04 ///< Arbitration error occurred.                    
                                                                                            
#define SMB0CN_ACKRQ__BMASK        0x08 ///< SMBus Acknowledge Request                      
#define SMB0CN_ACKRQ__SHIFT        0x03 ///< SMBus Acknowledge Request                      
#define SMB0CN_ACKRQ__NOT_SET      0x00 ///< No ACK requested.                              
#define SMB0CN_ACKRQ__REQUESTED    0x08 ///< ACK requested.                                 
                                                                                            
#define SMB0CN_STO__BMASK          0x10 ///< SMBus Stop Flag                                
#define SMB0CN_STO__SHIFT          0x04 ///< SMBus Stop Flag                                
#define SMB0CN_STO__NOT_SET        0x00 ///< A STOP is not pending.                         
#define SMB0CN_STO__SET            0x10 ///< Generate a STOP or a STOP is currently pending.
                                                                                            
#define SMB0CN_STA__BMASK          0x20 ///< SMBus Start Flag                               
#define SMB0CN_STA__SHIFT          0x05 ///< SMBus Start Flag                               
#define SMB0CN_STA__NOT_SET        0x00 ///< A START was not detected.                      
#define SMB0CN_STA__SET            0x20 ///< Generate a START, repeated START, or a START is
                                        ///< currently pending.                             
                                                                                            
